<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"84cdbbfb68c92a493e462dd3f74f32513458e39ad2d3784a34dd552c18baeaf2","plan_job_ref":"Job Run Terraform plan in staging #254 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14866392767","plan_out_hash":"c82203575cf300e68129bf190fb7b4b7c77c22c22042822725d5ab9b20bb8b51","plan_hash":"3a39806d3fe1889992889e5a3847963ae1312779228a996de8691b5367e1db6c","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous_monitoring-staging.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "6kHe57oZ/NYFlXRGCzB8HvQWzZd3QlybmyfaTR7yQaw=" -> "sC3KxKKJHGtmIsJ86XFIZ/z3VAMcCSqPvmTxJ0Ay+bU="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-05T21:46:17Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "af32b47f-3068-43a9-b31a-498745b66b7f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "6a4244b6-9b21-4eba-ad87-4b324d5d984e"
!~      updated_at   = "2025-05-05T21:46:17Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #254](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14866392767)